app/controllers/schools_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students"
---
  def show
    @school = School.find(params[:id])
    @students = Student.all