app/controllers/students_controller.rb

  def new
    @student = Student.new
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def edit
    @student = Student.find(params[:id])
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

  def update
    @student = Student.find(params[:id])
    @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 10], ["school_id", 38], ["updated_at", "2020-01-10 18:06:45.280718"], ["id", 8]]

  def create
    @student = Student.create(student_params)
---
INSERT INTO "students" ("name", "age", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Josh"], ["age", 19], ["school_id", 39], ["created_at", "2020-01-10 17:56:42.706532"], ["updated_at", "2020-01-10 17:56:42.706532"]]

  def destroy
    Student.destroy(params[:id])
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 12]]