app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (name LIKE '%Julie%' ) ORDER BY created_at DESC
---
  def index
    @students = Student.all